Конфигурация/InformationRegisters/ВхожденияВРеестры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВхожденияВРеестры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсключенИзРеестра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДержательРеестра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВРеестре</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеестра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеестров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ВхожденияВРеестры/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл 
		Если Запись.ИсключенИзРеестра Тогда
			Если ЗначениеЗаполнено(Запись.ДержательРеестра) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При исключении из реестра 'Держатель реестра' должен быть пустой",,,, Отказ);
			КонецЕсли;
			Если ЗначениеЗаполнено(Запись.НомерВРеестре) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При исключении из реестра 'Номер в реестре' должен быть пустой",,,, Отказ);
			КонецЕсли;
			
		Иначе
			Если НЕ ЗначениеЗаполнено(Запись.ДержательРеестра) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле 'Держатель реестра'",,,, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Запись.НомерВРеестре) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле 'Номер в реестре'",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
